{
  "about": {
    "title": "I'm a Full Stack Developer with a Informatic Engineer degree that resides in El Salvador",
    "description": "Full stack developer with 5+ years of experience specialized in React and React Native. I’ve worked with 10+ applications mobile and web. Improving code quality and efficiency with CI/CD implementations. Expert in optimization of performance and deliver of scalable solutions."
  },
  "capabilities": {
    "description": "Experience developing web and mobile applications, creation of scalable solutions backend services, creation of CI/CD solutions, code quality tests and optimization of performance. I have experience working with people of different countries and cultures. Also used a lot of tools like Microsoft Teams, Trello, Jira, etc.",
    "capabilitiesList": [
      "Javascript",
      "Typescript",
      "React",
      "NextJs",
      "React Native",
      "Nestjs",
      "Express",
      "SQL",
      "MongoDB",
      "Prisma",
      "Figma",
      "Azure",
      "Docker"
    ]
  },
  "experience": {
    "experienceList": [
      {
        "title": "Full Stack Developer",
        "company": "Coderland By Dominion Global",
        "startDate": "06/2024",
        "endDate": "01/2025",
        "description": "Designed and developed solutions using frontend and backend technologies. For the frontend used react native with cli and expo with typescript and React for web implementations. NodeJs with typescript for the backend, also worked with .net 6 and 8 creating migrations and services to SOAP and REST apis. Gave maintenance to multiple services using graphQL queries and mutations, resolvers, federations, codegen command creations, etc. Worked using environment variables using K8 and pipelines yaml files creation. I acquired experience using Azure environment like creating logic apps, the use of blob storage and pipelines config. Handling multiple repo using NX monorepo technologies and applying code coverage and unit testing for nodejs using jest. Worked with agile technologies, being moderator in dailys, plannings and review, using tools like azure boards, Microsoft teams and miro for meetings. Also Managed using tools for database management like dbeaver, redis cache manager, mongodb, lens, etc."
      },
      {
        "title": "Frontend Developer",
        "company": "Koibanx",
        "startDate": "05/2021",
        "endDate": "10/2023",
        "description": "Developed frontend solutions (Web and mobile apps) for web3 applications using JS frameworks: Web and PWA usingNextJs with Typescript. Developed Mobile applications using React Native with JavaScript and Typescript. Integrationswith web3 components like bitso using API REST endpoints. Mounted applications based on designs by figma.Delivered production rollouts and control versions for IOS and Android stores. Good Practice implementation withEslint rules, prettier code formatter and husky commits. Administered the tasks using Agile methodologies (SCRUM),experience with JIRA tool. REST API integrations(Axios) Repository Management (Git/Gitlab)."
      },
      {
        "title": "React Native Developer",
        "company": "Applaudo Studios",
        "startDate": "09/2020",
        "endDate": "04/2021",
        "description": "Colaborated with implementation of features for Multimoney app Android and IOS. Integration with crypto endpoints Paxos Gold. Mobile apps developed using JavaScript React Native Framework. Handled criticaldeployments and features completition in scheduled times. Task management using SCRUM agilemethodologies with JIRA. Implemented and managed information provided by APIS using fetch and Axios.Deployed production rollouts and control versions for IOS and Android. Repository Management (Git/Gitlab). CI/CD rollouts for React Native apps with Bitrise."
      },
      {
        "title": "Frontend Developer",
        "company": "Vincu Hub",
        "startDate": "05/2019",
        "endDate": "09/2020",
        "description": "Developed frontend pages and mobile apps using JavaScript framework (React Native, React and Vue.js) Integration with services (Authentication, database, push notifications) from Google's Firebase Consumptionand management of information provided by APIS. Delivered production rollouts and control versions for IOSand Android. Repository Management (Git/Gitlab)."
      }
    ]
  }
}
